Обработки/DataProcessors/_ИмпортСписковДляСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ИмпортСписковДляСверки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьЗакрытыеСчетаИСвязанныеЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьНоминальныхДержателейПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузитьСпискиВЛКК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЮрФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЮрФизЛица</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>400</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1023</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ИмпортСписковДляСверки/_ИмпортСписковДляСверки/Forms/Форма/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Элементы.КомандаОтладкаКоманд.Видимость = Не ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза");
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Каталог            	= ЭтаФорма.ИмяФайла; 
	Диалог.Фильтр				= "Файл XML, ZIP-архив (*.xml;*.zip)|*.xml;*.zip";
	Диалог.МножественныйВыбор 	= Ложь; 
	Диалог.Заголовок          	= "Выберите файл"; 
	
	Диалог.Показать(Новый ОписаниеОповещения("ИмяФайлаНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда 
		
		ЭтаФорма.ИмяФайла = Диалог.ПолноеИмяФайла;
		КомандаПрочитатьФайл(Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.ИмяФайла);
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПрочитатьФайл(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПрочитатьФайл");
	
	Файл = Новый Файл(ЭтаФорма.ИмяФайла);
	
	Если Файл.Существует() Тогда
		
		Попытка
			АдресДанных = УпаковатьФайл();
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
			Возврат;
		КонецПопытки;
		
		ПрочитатьФайлНаСервере(АдресДанных, ПараметрыСессии);
		
	КонецЕсли;
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаИмпортировать");
	ВыполнитьИмпорт(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура НастроитьВидимостьИДоступность()

	Элементы.ВерсияФормата.Видимость 	= (Объект.ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокРешенийМВК Или Объект.ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокФРОМУ);
	Элементы.Идентификатор.Видимость 	= (Объект.ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокТеррористов);
	Элементы.НомерСписка.Видимость 		= (Объект.ВидСписка = Справочники.ВидыПеречнейОбъектов.СписокТеррористов);
	Элементы.ДатаПубликации.Видимость	= (Объект.ВидСписка = Справочники.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция УпаковатьФайл()

	ДанныеФайла = РаботаСФайламиКлиентСервер.РазложитьПолноеИмяФайла(ЭтаФорма.ИмяФайла);
	ДанныеФайла.Вставить("ДвоичныеДанные", Новый ДвоичныеДанные(ЭтаФорма.ИмяФайла));
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеФайла, ЭтаФорма.УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура ВыполнитьИмпорт(ПараметрыСессии)
	
	Если Объект.ВидСписка = ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН")
		И Не ЗначениеЗаполнено(Объект.ДатаПубликации) Тогда
		
		ТекстОшибки = "Поле ""Дата публикации"" не заполнено";
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,, "ДатаПубликации");
		Возврат;
		
	КонецЕсли;	
	
	Файл = Новый Файл(ЭтаФорма.ИмяФайла);
	
	Если Объект.СписокЮрФизЛиц.Количество() > 0 И Файл.Существует() Тогда
		
		АдресДанных = УпаковатьФайл();
		ИмпортироватьНаСервере(АдресДанных);
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьСверкуПослеИмпорта", ЭтаФорма), 
			"Выполнить сверку со списокм?", 
			РежимДиалогаВопрос.ДаНет,
			,
			,
			"Загрузка завершена");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(АдресДанных, ПараметрыСессии)

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если ОбъектНаСервере.ПрочитатьФайл(АдресДанных, ПараметрыСессии) Тогда
		ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
		НастроитьВидимостьИДоступность();
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(АдресДанных);

КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНаСервере(АдресДанных)

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ОбъектНасервере.СохранитьСписокДляСверкиВExternals(АдресДанных);
	
	УдалитьИзВременногоХранилища(АдресДанных);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуПослеИмпорта(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда
		
		РезультатСверки = ВыполнитьСверкуСоСпискомНаСервере();
		
		Если РезультатСверки = Неопределено Тогда
			ПоказатьПредупреждение(, "При выполнении сверки прозошли ошибки!");
		Иначе
			РезультатСверки.ОтчетОСверке.Показать(РезультатСверки.Заголовок);
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьСверкуСоСпискомНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектНаСервере.ВыполнитьСверкуСоСписком();
	
КонецФункции
 
#КонецОбласти 

&НаКлиенте
Процедура КомандаОтладкаКоманд(Команда)

	СписокКоманд = ПолучитьСписокКоманд();
	ПараметрыКоманды = СписокКоманд.ВыбратьЭлемент();
	Если ПараметрыКоманды <> Неопределено Тогда
		ОтладкаКомандНаСервере(ПараметрыКоманды.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКоманд()

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ДополнительнаяОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта(ОбъектНаСервере.Метаданные().Имя);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК ДополнительнаяОбработкаСсылка,
		|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК ИдентификаторКоманды,
		|	ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров КАК ГруппаПараметров,
		|	ДополнительныеОтчетыИОбработкиКоманды.Представление + "" ("" + ЕСТЬNULL(ДополнительныеОтчетыИОбработкиГруппыПараметров.Имя, """") + "")"" КАК Представление
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.ГруппыПараметров КАК ДополнительныеОтчетыИОбработкиГруппыПараметров
		|		ПО ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработкиГруппыПараметров.Ссылка
		|			И ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров = ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор
		|ГДЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДополнительнаяОбработкаСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СписокКоманд = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыКоманды = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ГруппаПараметров");
		
		ЗаполнитьЗначенияСвойств(ПараметрыКоманды, Выборка);
		СписокКоманд.Добавить(ПараметрыКоманды, Выборка.Представление)
	
	КонецЦикла;

	Возврат СписокКоманд;

КонецФункции

&НаСервере
Процедура ОтладкаКомандНаСервере(ПараметрыКоманды)
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ВыполнитьКоманду(ПараметрыКоманды.ИдентификаторКоманды, ПараметрыКоманды);
		
КонецПроцедуры 

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)

	РеквизитФормыВЗначение("Объект").ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);

КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
		
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры
